Билет_сервер/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Пояснение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет_сервер/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МетодСписания</name>
    <type>
      <types>EnumRef.МетодыСписания</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Билет_сервер/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ИзменениеУчетнойПолитики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет_сервер/src/Enums/МетодыСписания/МетодыСписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыСписания</name>
  <enumValues>
    <name>ПоСредней</name>
  </enumValues>
  <enumValues>
    <name>ФИФО</name>
  </enumValues>
</mdclass:Enum>

Билет_сервер/src/Documents/ПриходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	УчетнаяПолитикаСрезПоследних.Регистратор,
	|	УчетнаяПолитикаСрезПоследних.МетодСписания
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&ДатаСреза, ) КАК УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Результат=Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Данные=Результат.Выбрать();
		Данные.Следующий();
		Партия = ?(Данные.МетодСписания=Перечисления.МетодыСписания.ПоСредней, Данные.Регистратор, Ссылка);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена учетная политика.";
		Сообщение.Сообщить();
		Отказ=Истина;
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиНоменклатуры.Записывать=Истина;
	Движения.ОстаткиНоменклатуры.Очистить();
	
	Для Каждого Строка из СписокНоменклатуры Цикл
		Движение=Движения.ОстаткиНоменклатуры.Добавить();
		Движение.Период=Дата;
		Движение.Номенклатура=Строка.Номенклатура;
		Движение.Партия=Партия;
		Движение.Количество=Строка.Количество;
		Движение.Сумма=Строка.Сумма;
	КонецЦикла;
	
КонецПроцедуры
